export const options = [
  {
    id: 1,
    title: 'коммерческие помещения',
    description: '10 000 метров коммерческих помещений - фермерские лавки, винные бутики, кофейни, барбершопы, салоны красоты, стоматологические кабинеты\n'
            + 'Застройщиком спроектированы различные планировки – одно-, двух- и трехкомнатные квартиры, общей площадью от 30 до 73,5 кв.м. Все их объединяет несколько общих характеристик — это эргономичное распределение жилой площади и достаточный простор, интересные и современные варианты планировочных решений. Благоустройство прилегающей территории понравится жителям всех возрастов.',
    pictures: ['/img/slider_ex1.jpg', '/img/slider_ex2.jpg'],
  },
  {
    id: 2,
    title: 'парковки',
    description: '10 000 метров коммерческих помещений - фермерские лавки, винные бутики, кофейни, барбершопы, салоны красоты, стоматологические кабинеты\n'
            + 'Застройщиком спроектированы различные планировки – одно-, двух- и трехкомнатные квартиры, общей площадью от 30 до 73,5 кв.м. Все их объединяет несколько общих характеристик — это эргономичное распределение жилой площади и достаточный простор, интересные и современные варианты планировочных решений. Благоустройство прилегающей территории понравится жителям всех возрастов.',
    pictures: ['/img/slider_ex1.jpg', '/img/slider_ex2.jpg'],
  },
  {
    id: 3,
    title: 'тест',
    description: '10 000 метров коммерческих помещений - фермерские лавки, винные бутики, кофейни, барбершопы, салоны красоты, стоматологические кабинеты\n'
            + 'Застройщиком спроектированы различные планировки – одно-, двух- и трехкомнатные квартиры, общей площадью от 30 до 73,5 кв.м. Все их объединяет несколько общих характеристик — это эргономичное распределение жилой площади и достаточный простор, интересные и современные варианты планировочных решений. Благоустройство прилегающей территории понравится жителям всех возрастов.',
    pictures: ['/img/slider_ex1.jpg', '/img/slider_ex2.jpg'],
  },
];
