import Link from 'next/link';
import SvgSprite from '@/components/UI/SvgSprite';
// eslint-disable-next-line import/no-extraneous-dependencies
import { YMaps, Map, Placemark } from '@pbe/react-yandex-maps';
// eslint-disable-next-line import/no-extraneous-dependencies
import ymapsTouchScroll from 'ymaps-touch-scroll';
import LinkWIthArrowAndText from '@/components/Layout/Header/LinkWIthArrowAndText';
import MobileLink from '@/components/Layout/Footer/MobileLink';

const Footer = () => {
  const cols = [
    {
      id: 1,
      title: 'Выбор квартиры',
      links: [
        {
          id: 1,
          title: 'Визуальный подбор',
          path: '/',
        },
        {
          id: 2,
          title: 'Параметрический подбор',
          path: '/',
        },
        {
          id: 3,
          title: 'Коммерция',
          path: '/',
        },
        {
          id: 4,
          title: 'Паркинг',
          path: '/',
        },
      ],
    },
    {
      id: 2,
      title: 'Проекты',
      links: [
        {
          id: 1,
          title: 'ЖК «Осипенко»',
          path: '/',
        },
        {
          id: 2,
          title: 'ЖК «Елизарова»',
          path: '/',
        },
        {
          id: 3,
          title: 'МКР «Тура-2»',
          path: '/',
        },
        {
          id: 4,
          title: 'МКР «Ноантипинский»',
          path: '/',
        },
      ],
    },
    {
      id: 3,
      title: 'Покупателям',
      links: [
        {
          id: 1,
          title: 'Как купить',
          path: '/',
        },
        {
          id: 2,
          title: 'Новости и акции',
          path: '/',
        },
        {
          id: 3,
          title: 'Документы',
          path: '/',
        },
        {
          id: 4,
          title: 'FAQ',
          path: '/',
        },
      ],
    },
    {
      id: 4,
      title: 'Компания',
      links: [
        {
          id: 1,
          title: 'О компании',
          path: '/',
        },
        {
          id: 2,
          title: 'Контакты',
          path: '/',
        },
      ],
    },
  ];
  const desctopLinks = cols.map((item) => {
    const itemLinks = item.links.map((link) => (
      <li>
        <Link href={link.path} className="t3 text-black/80 py-2 transition-color duration-500 hover:text-black">{link.title}</Link>
      </li>
    ));
    return (
      <div className="flex flex-col gap-5">
        <div className="h13 whitespace-nowrap">{item.title}</div>
        <nav>
          <ul className="flex flex-col gap-3">
            {itemLinks}
          </ul>
        </nav>
      </div>
    );
  });
  const mobileLinks = cols.map((item) => <MobileLink item={item} />);

  return (
    <footer>
      <div className="container py-6 md:py-10">
        <div className="flex flex-col md:flex-row justify-between items-start md:items-center mb-6 md:mb-8 gap-4 md:gap-6">
          <Link href="tel:+73452581818" className="font-tt font-light text-base md:text-lg 3xl:text-5xl tracking-normal uppercase">+7 (3452) 58-18-18</Link>
          <div className="w-full md:w-[400px]">
            <LinkWIthArrowAndText text="перейти <br> к выбору квартир" />
          </div>
        </div>
        <div className="flex flex-col xl:flex-row border-y-[1px] border-y-black ">
          <div className="w-full xl:w-[50%] pt-6 lg:pt-10 px-0 xl:px-8 mb-0 3xl:mb-24">
            <div className="grid-cols-2 3xl:grid-cols-3 gap-x-8 gap-y-10 3xl:gap-y-16 hidden md:grid">
              {desctopLinks}
            </div>
            <div className="grid-cols-1 gap-y-6 grid md:hidden border-b-[1px] border-b-black pb-4">
              {mobileLinks}
            </div>
          </div>
          <div className="w-full xl:w-[50%] pb-12 pt-6 lg:pt-10 px-0 xl:px-8 border-l-none xl:border-l-[1px] xl:border-l-black">
            <div className="flex flex-col md:flex-row gap-4 md:gap-12 mb-8">
              <div className="w-full md:w-[60%] h14">г. Тюмень, ул. 50 лет Октября, 215, стр 13</div>
              <div className="flex flex-col items-start md:items-end w-full md:w-[40%]">
                <div className="h14">пн – пт, 09:00 – 21:00</div>
                <div className="h14">сб – вс, 10:00 – 20:00</div>
              </div>
            </div>
            <YMaps>
              <Map
                instanceRef={(ref) => {
                  // eslint-disable-next-line @typescript-eslint/no-unused-expressions
                  ref && ymapsTouchScroll(ref);
                }}
                defaultState={{ center: [57.116717, 65.637374], zoom: 16 }}
                width="100%"
                height="100%"
              >
                <Placemark
                  geometry={[57.116717, 65.637374]}
                  properties={{
                    iconContent: `
                    <div class='custom-placemark w-[80px] hover:fill-[#9B523B] whitespace-nowrap -translate-x-[50%] -translate-y-[25%] transition duration-100 cursor-pointer'>
                        <svg width="80" height="25" viewBox="0 0 206 56" xmlns="http://www.w3.org/2000/svg">
                          <path fill-rule="evenodd" clip-rule="evenodd" d="M60.9219 29.521V0H94.5671V6.94611H70.6899V11.0704H84.5821H94.5671V29.521H84.5821H60.9219ZM70.6899 21.9237V17.1482H87.1001V21.9237H70.6899Z"/>
                          <path fill-rule="evenodd" clip-rule="evenodd" d="M41.816 14.2395L53.7547 0.217065V0H42.4672L33.9148 10.8967H32.1349V0H23.0181V10.8967H21.2382L12.6858 0H1.39839V0.217065L13.337 14.2395L0.747192 29.3039V29.521H12.816L21.3684 18.7111H23.0181V29.521H32.1349V18.7111H33.7846L42.337 29.521H54.4059V29.3039L41.816 14.2395ZM105.436 29.521H120.674L132.7 6.94611H133.004V29.521H142.772V0H127.534L115.507 22.5749H115.204V0H105.436V29.521ZM151.685 21.0554H167.964V14.5434H151.685V21.0554Z"/>
                          <path d="M173.057 29.521V23.5L194.677 23.5V17.756L180.394 17.756V11.6781H194.677V6.46856H173.057V0.173652H205.747V10.8292L199.8 14.5434L205.747 17.756V29.521L173.057 29.521Z"/>
                          <path d="M19.7705 49.5465H22.4187V55.7329H18.9456V52.4335H7.4628V55.7329H3.98975V49.5465H6.31235C6.77542 48.8374 7.12273 47.7087 7.35427 46.1603L8.04888 41.4934H19.7705V49.5465ZM10.8707 46.3774C10.6826 47.7521 10.357 48.8085 9.89394 49.5465H16.2323V44.3804H11.1529L10.8707 46.3774ZM27.7564 48.0054V49.959C30.0573 49.959 32.0037 49.9228 33.5955 49.8504C35.1873 49.7636 36.9673 49.6189 38.9353 49.4163L38.8051 52.4335C37.7342 52.5203 36.468 52.5927 35.0064 52.6506C33.5593 52.7229 32.2931 52.7591 31.2078 52.7591C29.2976 52.7591 27.8216 52.5927 26.7796 52.2598C25.7522 51.927 25.0214 51.3699 24.5873 50.5884C24.1532 49.7925 23.9361 48.671 23.9361 47.2239C23.9361 45.6176 24.1749 44.3876 24.6524 43.5338C25.1299 42.6655 25.9331 42.0578 27.0618 41.7105C28.205 41.3487 29.833 41.1678 31.9458 41.1678C34.0441 41.1678 35.6576 41.3414 36.7864 41.6887C37.9296 42.036 38.74 42.6221 39.2175 43.447C39.6951 44.2718 39.9338 45.444 39.9338 46.9634C39.9338 47.3107 39.9049 47.6581 39.847 48.0054H27.7564ZM31.9458 44.0548C30.5566 44.0548 29.1601 44.0982 27.7564 44.185V45.8347H36.2003V44.185C34.7821 44.0982 33.364 44.0548 31.9458 44.0548ZM55.6066 46.8983C56.9379 47.2746 57.6036 48.1356 57.6036 49.4814C57.6036 50.4944 57.2418 51.2396 56.5183 51.7172C55.8092 52.1947 54.6732 52.4335 53.1103 52.4335H42.6478V41.4934H52.7413C54.3042 41.4934 55.4402 41.7322 56.1493 42.2097C56.8728 42.6872 57.2346 43.4253 57.2346 44.4238C57.2346 45.6249 56.6919 46.4497 55.6066 46.8983ZM53.5879 45.813V44.0548H46.1859V45.813H53.5879ZM46.1859 49.8721H53.9569V47.9837H46.1859V49.8721ZM63.602 48.0054V49.959C65.9029 49.959 67.8492 49.9228 69.4411 49.8504C71.0329 49.7636 72.8128 49.6189 74.7809 49.4163L74.6506 52.4335C73.5798 52.5203 72.3136 52.5927 70.852 52.6506C69.4049 52.7229 68.1387 52.7591 67.0533 52.7591C65.1431 52.7591 63.6671 52.5927 62.6252 52.2598C61.5977 51.927 60.867 51.3699 60.4328 50.5884C59.9987 49.7925 59.7816 48.671 59.7816 47.2239C59.7816 45.6176 60.0204 44.3876 60.4979 43.5338C60.9755 42.6655 61.7786 42.0578 62.9074 41.7105C64.0506 41.3487 65.6786 41.1678 67.7914 41.1678C69.8897 41.1678 71.5032 41.3414 72.6319 41.6887C73.7751 42.036 74.5855 42.6221 75.0631 43.447C75.5406 44.2718 75.7794 45.444 75.7794 46.9634C75.7794 47.3107 75.7504 47.6581 75.6926 48.0054H63.602ZM67.7914 44.0548C66.4021 44.0548 65.0057 44.0982 63.602 44.185V45.8347H72.0458V44.185C70.6277 44.0982 69.2095 44.0548 67.7914 44.0548ZM78.7206 52.7591C78.3878 52.7591 77.9898 52.7446 77.5268 52.7157C77.0782 52.7012 76.7164 52.6723 76.4414 52.6289L76.3329 49.4163C77.8234 49.5755 79.0028 49.6551 79.8711 49.6551L80.7827 41.4934H92.8516V52.4335H89.2049V44.4889H84.0387L83.5395 48.9387C83.3948 50.2411 82.9245 51.2035 82.1286 51.8257C81.3471 52.448 80.2111 52.7591 78.7206 52.7591ZM104.152 52.7591C101.996 52.7591 100.324 52.5855 99.1375 52.2381C97.9653 51.8908 97.126 51.3048 96.6195 50.4799C96.1275 49.6551 95.8815 48.4829 95.8815 46.9634C95.8815 45.444 96.1275 44.2718 96.6195 43.447C97.126 42.6221 97.9653 42.036 99.1375 41.6887C100.324 41.3414 101.996 41.1678 104.152 41.1678C106.308 41.1678 107.972 41.3414 109.144 41.6887C110.331 42.036 111.17 42.6221 111.662 43.447C112.169 44.2718 112.422 45.444 112.422 46.9634C112.422 48.4829 112.169 49.6551 111.662 50.4799C111.17 51.3048 110.331 51.8908 109.144 52.2381C107.972 52.5855 106.308 52.7591 104.152 52.7591ZM104.152 49.7636C104.933 49.7636 105.758 49.7491 106.626 49.7202C107.495 49.6912 108.138 49.6551 108.558 49.6116V44.3152C108.138 44.2718 107.495 44.2357 106.626 44.2067C105.758 44.1778 104.933 44.1633 104.152 44.1633C103.37 44.1633 102.545 44.1778 101.677 44.2067C100.809 44.2357 100.165 44.2718 99.7453 44.3152V49.6116C100.165 49.6551 100.809 49.6912 101.677 49.7202C102.545 49.7491 103.37 49.7636 104.152 49.7636ZM119.109 52.4335H115.462V41.4934H130.093V52.4335H126.446V44.4889H119.109V52.4335ZM137.358 52.4335H133.778V41.4934H139.443L142.678 47.6581H142.785L146.02 41.4934H151.556V52.4335H147.974V43.8594H147.866L144.349 50.545H140.985L137.468 43.8594H137.358V52.4335ZM158.42 48.0054V49.959C160.721 49.959 162.667 49.9228 164.259 49.8504C165.851 49.7636 167.631 49.6189 169.599 49.4163L169.468 52.4335C168.398 52.5203 167.131 52.5927 165.67 52.6506C164.223 52.7229 162.956 52.7591 161.871 52.7591C159.961 52.7591 158.485 52.5927 157.443 52.2598C156.415 51.927 155.685 51.3699 155.251 50.5884C154.816 49.7925 154.599 48.671 154.599 47.2239C154.599 45.6176 154.838 44.3876 155.316 43.5338C155.793 42.6655 156.596 42.0578 157.725 41.7105C158.868 41.3487 160.496 41.1678 162.609 41.1678C164.707 41.1678 166.321 41.3414 167.45 41.6887C168.593 42.036 169.403 42.6221 169.881 43.447C170.358 44.2718 170.597 45.444 170.597 46.9634C170.597 47.3107 170.568 47.6581 170.51 48.0054H158.42ZM162.609 44.0548C161.22 44.0548 159.823 44.0982 158.42 44.185V45.8347H166.864V44.185C165.445 44.0982 164.027 44.0548 162.609 44.0548ZM184.621 45.3137V41.4934H188.268V52.4335H184.621V48.3093H176.958V52.4335H173.312V41.4934H176.958V45.3137H184.621ZM199.171 52.4335H195.525V44.4889H190.011V41.4934H204.685V44.4889H199.171V52.4335Z"/>
                        </svg>
                        <div class="colored-placemark fill-[#9B523B]">
                          <svg width="17" height="28" viewBox="0 0 17 28" xmlns="http://www.w3.org/2000/svg">
                              <path d="M8.0962 0C5.94892 0 3.88966 0.846834 2.37131 2.35428C0.85296 3.86172 0 5.9062 0 8.03805C0 12.4782 8.0962 27.4579 8.0962 27.4579C8.0962 27.4579 16.1923 12.4793 16.1923 8.03805C16.1923 5.9062 15.3393 3.86172 13.821 2.35428C12.3027 0.846834 10.2434 0 8.0962 0ZM8.0962 11.8791C7.07009 11.8791 6.08602 11.4744 5.36048 10.7541C4.63486 10.0337 4.22727 9.05671 4.22727 8.03805C4.22727 7.01931 4.63486 6.0423 5.36048 5.32198C6.08602 4.60157 7.07009 4.19691 8.0962 4.19691C9.12222 4.19691 10.1063 4.60157 10.8319 5.32198C11.5574 6.0423 11.965 7.01931 11.965 8.03805C11.965 9.05671 11.5574 10.0337 10.8319 10.7541C10.1063 11.4744 9.12222 11.8791 8.0962 11.8791Z"/>
                          </svg>
                        </div>
                      </div>
                    </div>
                    `,
                  }}
                />
              </Map>
            </YMaps>
          </div>
        </div>
        <div className="flex py-5 flex-col-reverse gap-2 md:gap-4 2xl:flex-row 2xl:gap-0">
          <div className="flex flex-col-reverse md:flex-row justify-between w-full 2xl:w-[50%] 2xl:pr-[105px] group">
            <Link href="/" className="h-fit">
              <div className="inline-flex justify-center t7 text-black/50 hover:text-black transition-color duration-500">
                <div className="">Разработка и продвижение сайта - </div>
                <div className="mt-[2px]">
                  <SvgSprite src="/svg/aero-logo.svg" width={80} height={11} />
                </div>
              </div>
            </Link>
            <Link href="/" className="h-fit">
              <div className="flex gap-1 md:gap-0 md:flex-col items-end 2xl:justify-center 2xl:items-center t7 text-black/50 transition-color duration-500 hover:text-black">
                <div className="">Политика </div>
                <div className="">конфиденциальности</div>
              </div>
            </Link>
          </div>
          <div className="flex flex-col md:flex-row gap-2 md:gap-0 justify-between w-full 2xl:w-[50%] 2xl:pl-8">
            <div className="w-full md:w-[60vw] 2xl:w-[307px] 3xl:w-[507px] t7 transition-color duration-500 text-black/50">Обращаем Ваше внимание на то, что данный сайт носит исключительно информационный характер и ни при каких условиях информационные материалы и цены, размещенные на сайте, не являются публичной офертой. Застройщик имеет право изменять стоимость объектов. </div>
            <div className="t7 text-black/50">© 1971-2023, ООО СЗ «Завод ЖБИ –3»</div>
          </div>
        </div>
      </div>
    </footer>
  );
};

export default Footer;
